stromatocystites/Re100/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs            ("libOpenFOAM.so" "libfieldFunctionObjects.so");

application     pisoFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         120;  

deltaT          0.2;	// width of smallest cell ~6E-4 m. CFL cond: t >= x/u = 6E-4/0.0033 = 0.18

writeControl    runTime;

writeInterval   0.2;

purgeWrite      0;

writeFormat     ascii;

writePrecision  7;  // 6

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;
functions
{
   forces
    {
        type            forceCoeffs;
        libs            ("libforces.so");
        writeControl    writeTime;
        writeInterval   1;
        patches         (HH);
        rho             rhoInf;
        log             true;
        rhoInf          1025;
        liftDir         (0 0 1);
        dragDir         (1 0 0);
        CofR            (0 0 0);
        pitchAxis       (0 0 1);
        magUInf         0.0033;
        lRef            0.03;
        Aref            0.00114;        // see /analysis/parameters.py
    }
}
}

// ************************************************************************* //
